app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "comments" ("content", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["content", "test"], ["created_at", "2015-12-18 06:31:13.139675"], ["post_id", 3], ["updated_at", "2015-12-18 06:31:13.139675"]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(params.require(:comment).permit(:content))

    if @comment.save