app/controllers/posts_controller.rb

	 def create
	    post = Post.new(post_params)

	    if post.save!
---
INSERT INTO "posts" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)