app/controllers/users_controller.rb

	def create
		 @user = User.new(user_params)
			if @user.save      #if user regist successfully
---
INSERT INTO "users" ("created_at", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-12-13 09:05:23.003071"], ["name", "Lily"], ["password_digest", "$2a$10$MExiMmWXx6grrQo6UnQhtuQd12rC8vYd5dYes60pVQAcrpBWlVBTW"], ["updated_at", "2015-12-13 09:05:23.003071"]]